cases/heatedWire/constant/reactions
species
3
(
H2O
H2OL
N2
)
;

reactions
{
}
