cases/heatedWire/0.org/alphaLiquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaLiquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    Top
    {
        type            inletOutlet;
        inletValue      uniform 1.0;
        value           uniform 1.0;
    }
        
    Sides
    {
        type            symmetryPlane;
    }
    
    Bottom
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    
    Wire
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    
    FrontAndBack
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
