cases/heatedWire/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// pressure inside the droplets is set higher due to the surface tension
// and radius (dP = 4*sigma/r)
defaultFieldValues
(
    volScalarFieldValue alphaCH6N2 0
    volScalarFieldValue alphaN2 1
    volScalarFieldValue alphaN2O4 0
    volScalarFieldValue alphaCO2 0
    volScalarFieldValue alphaH2O 0
    volScalarFieldValue N2 1
    volVectorFieldValue U ( 0 0 0 )
    volScalarFieldValue p 100000
);

regions
(
    //Set droplet A
    sphereToCell
    {
        centre (0.00145 0.002 0.0005);
        radius 0.0005; //1 mm diameter
        fieldValues
        (
            volScalarFieldValue alphaN2O4 1
            volScalarFieldValue alphaN2 0
            volVectorFieldValue U (1 0 0)
            volScalarFieldValue N2O4 1
            volScalarFieldValue N2 0
            volScalarFieldValue p 100560
        );

    }

    //Set droplet B
    sphereToCell
    {
        centre (0.00255 0.002 0.0005);
        radius 0.0005; //1 mm diameter
        fieldValues
        (
            volScalarFieldValue alphaCH6N2 1
            volScalarFieldValue alphaN2O4 0
            volScalarFieldValue alphaN2 0
            volVectorFieldValue U (-1 0 0)
            volScalarFieldValue CH6N2 1
            volScalarFieldValue N2O4 0
            volScalarFieldValue N2 0
            volScalarFieldValue p 100560
        );

    }


);


// ************************************************************************* //
